x1,y1,x2,y2,x3,y3 = map(float, input("Введіть точки в один рядок(x,y): ").split())
if(y1>=1 and y1<=5 and y1>=2*(x1**2)
    and y2>=1 and y2<=5 and y2>=2*(x2**2)
    and y3>=1 and y3<=5 and y3>=2*(x3**2)):
        if ((y2 - y1) / (x2 - x1) != (y3 - y1) / (x3 - x1)):
            ab = (((x2 - x1)**2) + ((y2 - y1)**2))**0.5
            bc =  (((x3 - x2)**2) + ((y3 - y2)**2))**0.5
            ac =  (((x3 - x1)**2) + ((y3 - y1)**2))**0.5
            print("Периметр: ", ab+bc+ac)
            print("Площа: ", (x1 * (y2 - y3) + x2 * (y3 - y1) + x3 * (y1 - y2))/2)
        else: print("Точки лежать на одній прямій")
else: print("Точки не належать площині R")

